# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [149]:
# import libraries here
import os
import pandas as pd
import statistics as st

In [4]:
os.getcwd()

'D:\\Repositories\\data-ft-par-labs\\Labs\\module_2\\3. Subsetting-Descriptive-Stats\\your-code'

In [7]:
os.chdir('D:\\Repositories\\data-ft-par-labs\\Labs\\module_2\\3. Subsetting-Descriptive-Stats\\data')

In [49]:
os.listdir()

['Temp_states.csv']

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
temp = pd.read_csv('Temp_states.csv')

#### Print `temp`.

In [55]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [57]:
# your code here
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

In [59]:
temp.shape

(7, 3)

In [ ]:
"""
your comments here

We have three columns, 7 rows.

The city name, the state and the temperature. 
I can't get an insight about the temperature since the temperature in the same state is varely different. 


"""

#### Select the rows where state is New York.

In [66]:
# your code here

temp.loc[temp['State']=='New York']

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [69]:
# your code here


temp.loc[temp['State']=='New York'].mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [123]:
(temp[['State', 'City']])

         State        City
0     New York         NYC
1     New York      Albany
2     New York     Buffalo
3  Connecticut    Hartford
4  Connecticut  Bridgeport
5   New Jersey      Treton
6   New Jersey      Newark

In [135]:
# your code here
temp.loc[temp['Temperature']>15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [136]:
# your code here

temp.loc[temp['Temperature']<15]

         City        State  Temperature
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
4  Bridgeport  Connecticut    14.444444

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [140]:
# your code here

temp.loc[(temp['Temperature']>15)&(temp['Temperature']<20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [180]:
temp.groupby('State').Temperature.agg('std')

State
Connecticut    1.964186
New Jersey     1.571348
New York       8.133404
Name: Temperature, dtype: float64

In [181]:
# your code here
temp.groupby('State').Temperature.agg('mean')

State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
Name: Temperature, dtype: float64

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [384]:
# your code here
employees = pd.read_csv('employees.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [385]:
# your code here
print(employees.shape)
print(employees.info())
print(employees.columns)
employees.describe().T

(500, 6)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Department  500 non-null    object
 1   Education   500 non-null    object
 2   Title       500 non-null    object
 3   Name        500 non-null    object
 4   Years       500 non-null    int64
 5   Salary      500 non-null    int64
dtypes: int64(2), object(4)
memory usage: 23.6+ KB
None
Index(['Department', 'Education', 'Title', 'Name', 'Years', 'Salary'], dtype='object')

        count    mean        std   min   25%   50%    75%    max
Years   500.0   7.556   4.465731   1.0   3.0   7.0  11.25   15.0
Salary  500.0  73.528  26.890061  30.0  50.0  72.0  97.00  120.0

In [386]:
employees

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
3        Admin    Master         VP  Manuella     15      33
4        Sales    Master    Analyst     Carla      6      38
..         ...       ...        ...       ...    ...     ...
495      Sales       PhD         VP    Calvin      2     119
496         HR    Master    Analyst    Dustin      6      67
497      Sales       PhD         VP   Winston     13      93
498         IT       PhD    Analyst      Earl     12     108
499      Sales    Master    Analyst     Alvin     13      48

[500 rows x 6 columns]

In [ ]:
"""
6 columns, 500 rows, two numerical columns(Years, Salary : int64)


"""

#### What's the average salary in this company?

In [197]:
# your code here

employees['Salary'].mean()

73.528

#### What's the highest salary?

In [198]:
# your code here
employees['Salary'].max()

120

#### What's the lowest salary?

In [199]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [200]:
# your code here

employees.loc[employees['Salary'].min()]

Department    Admin
Education       PhD
Title            VP
Name            Ben
Years             6
Salary           50
Name: 30, dtype: object

#### Find all the information about an employee called David.

In [202]:
# your code here

employees.loc[employees['Name']=='David']

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [203]:
employees.loc[employees['Name']=='David']['Salary']

0      58
124    31
Name: Salary, dtype: int64

In [ ]:
# your code here

#### Print all the rows where job title is associate.

In [204]:
# your code here

employees.loc[employees['Title']=='associate']

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [205]:
# Method 1
employees.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [206]:
# Method 2
employees.iloc[[1,2,3]]

  Department Education      Title      Name  Years  Salary
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33

#### Find the employees whose title is associate and whose salary is above 55.

In [207]:
# your code here

employees.loc[(employees['Title']=='associate')&(employees['Salary']>55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [210]:
# your code here
#winery.groupby('region').number_of_wines.agg(['describe', sum])
employees.groupby('Years').Salary.agg('mean')

Years
1     75.863636
2     75.857143
3     74.571429
4     77.129032
5     73.857143
6     72.382353
7     73.840000
8     64.250000
9     76.741935
10    73.351351
11    74.866667
12    73.454545
13    71.935484
14    70.968750
15    69.758621
Name: Salary, dtype: float64

####  What is the average salary per title?

In [211]:
# your code here
employees.groupby('Title').Salary.agg('mean')

Title
Analyst      73.703911
VP           72.907975
associate    73.968354
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [216]:
# your code here
employees['Salary'].describe()

count    500.000000
mean      73.528000
std       26.890061
min       30.000000
25%       50.000000
50%       72.000000
75%       97.000000
max      120.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [387]:
from bs4 import BeautifulSoup
import requests as r

In [388]:
url='https://www.verywellfamily.com/top-1000-baby-girl-names-2757832'

In [389]:
soup=BeautifulSoup(resp.content)

In [390]:
names = soup.select('#mntl-sc-block_1-0-13>li')

In [391]:
names = [i.text.strip('<li>') for i in names]

In [392]:
# your code here
lst = []
employees[['Name']].apply(lambda x : lst.append(x))

Name    None
dtype: object

In [397]:
woman = employees['Name'].agg(lambda x: x in names)

In [399]:
woman = employees.loc[employees['Name'].agg(lambda x: x in names)]

In [401]:
man = employees.loc[employees['Name'].agg(lambda x: x not in names)]

In [402]:
woman.Salary.mean()

76.45714285714286

In [405]:
woman.describe().T

        count       mean        std   min   25%   50%   75%    max
Years   105.0   7.361905   4.561806   1.0   4.0   7.0  11.0   15.0
Salary  105.0  76.457143  26.339510  31.0  52.0  77.0  99.0  119.0

In [412]:
woman.sample(30)

    Department Education      Title      Name  Years  Salary
494      Sales  Bachelor  associate   Vanessa     11     118
273         IT  Bachelor    Analyst   Charlie     15      99
349      Admin       PhD    Analyst   Rebecca     13      93
320         IT  Bachelor    Analyst     Jamie      3      56
424      Sales       PhD    Analyst   Melissa      4      59
201      Sales  Bachelor         VP     Megan     15      94
10       Admin    Master  associate   Cynthia      1     114
96          HR       PhD  associate     Robin      2      47
297      Admin  Bachelor    Analyst    Sandra      6     110
408         IT    Master    Analyst       Amy     15      84
210         IT  Bachelor         VP  Victoria      8      41
141         HR    Master  associate   Charlie      8      78
222         HR    Master    Analyst      Ryan     14      46
205         HR       PhD  associate     Elena      6      73
169      Admin       PhD    Analyst     Renee      4      92
417      Sales    Master    Analyst     Nancy      6     116
72          HR  Bachelor    Analyst  Patricia      9      97
125         HR       PhD  associate     Erika      7      94
377         IT  Bachelor    Analyst     Julie      3      36
135         HR       PhD         VP     Maria      6     101
20       Sales    Master    Analyst     Laura      9      56
145         IT  Bachelor  associate     Megan      3      98
193         IT    Master    Analyst     Laura      2      41
354      Admin  Bachelor    Analyst      Alan     14      63
307         IT    Master  associate     Robin      6      94
196         HR    Master  associate     Jamie      9     100
332         HR    Master         VP   Rebecca     11     119
341      Sales  Bachelor  associate   Violeta     12      79
464      Admin    Master  associate   Vanessa     12     107
436         IT    Master         VP    Andrea     12      51

In [403]:
man.Salary.mean()

72.7493670886076

In [408]:
man.describe().T

        count       mean        std   min   25%   50%   75%    max
Years   395.0   7.607595   4.444291   1.0   3.0   7.0  12.0   15.0
Salary  395.0  72.749367  27.013918  30.0  49.0  71.0  96.0  120.0

In [409]:
man.sample(30)

    Department Education      Title     Name  Years  Salary
239      Sales    Master    Analyst  Timothy     12      64
23       Sales       PhD  associate  Clayton      3      94
172      Sales       PhD  associate     Jose      2      73
158         IT    Master  associate     Paul     15      96
176         IT    Master         VP   Samuel      9      34
94          HR  Bachelor         VP      Ted      5     115
432         IT  Bachelor  associate  Winston      3      45
171         HR    Master         VP  Claudia      5      35
61       Sales  Bachelor    Analyst   Justin      8      85
50       Admin  Bachelor    Analyst  Brennan      3      82
450         IT  Bachelor         VP      Jay      9      81
431      Admin       PhD    Analyst      Don      1     120
163         HR       PhD    Analyst     Brad      4      79
331         IT       PhD  associate  Clayton      3      35
333         IT    Master    Analyst   Edward      5      31
234      Admin  Bachelor  associate     Greg      4     117
486         IT  Bachelor  associate      Jay     14      58
179      Sales       PhD  associate     Karl      3      87
352      Sales    Master  associate   Roland      3     120
120      Admin  Bachelor    Analyst  Winston     14      88
287         HR    Master    Analyst   Daniel      2      94
184         IT    Master  associate    Roman      9      43
52       Admin  Bachelor         VP      Jay      2      90
314         IT    Master  associate     Luis     11      47
441      Admin    Master         VP      Kim      9      88
290         HR  Bachelor  associate  Bradley     11      66
45          HR  Bachelor  associate    Kevin      2      98
253         HR    Master    Analyst   Melvin      9      44
62       Admin  Bachelor         VP     Alix      2      68
471         HR    Master         VP     Alix     11      54

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [425]:
employees.groupby('Department').agg([max, min, 'mean'])

           Years               Salary
             max min      mean    max min       mean
Department
Admin         15   1  7.642276    120  30  76.325203
HR            15   1  7.172131    119  30  74.237705
IT            15   1  8.141791    120  30  70.671642
Sales         15   1  7.206612    120  30  73.132231

In [ ]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [433]:
#winery.groupby('region').apply(lambda x: (x.average_rating*x.number_of_wines).sum()/x.number_of_wines.sum()).round(2)
# your code here
# Step 1 filter by department
# Setp 2 get the max salary per deparment
# Step 3 get the min salary per department
# Step 4 make the difference 

employees.groupby('Department').apply(lambda x : (max(x.Salary)-min(x.Salary)))

Department
Admin    90
HR       89
IT       90
Sales    90
dtype: int64

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here